{
  "id": "01794bde-9568-4795-b4d9-5e09105f3ba0",
  "request": {
    "method": "GET",
    "urlPathPattern": "/risk-management-plan/(.*)"
  },
  "response": {
    "headers": {
      "Content-Type": "application/json"
    },
    "status": 200,
    "jsonBody": {
      "assessmentId": 1310103,
      "assessmentType": "LAYER3",
      "dateCompleted": null,
      "assessorSignedDate": null,
      "initiationDate": "2022-11-02T15:17:29Z",
      "assessmentStatus": "OPEN",
      "superStatus": "WIP",
      "limitedAccessOffender": false,
      "lastUpdatedDate": "2022-11-29T10:37:22Z",
      "riskManagementPlan": {
        "furtherConsiderations": "[RM28] Mr Smith is currently on remand awaiting sentence",
        "additionalComments": "[RM35] Placeholder content for additional comments",
        "contingencyPlans": "[RM34] Discuss any concerns with line manager/SPO Increase frequency of reporting Bring forward MAPPA/Consider Level 2 MAPPA professionals meetings  considered if MAPPA not applicable. Consider referral to Approved Premises Consider motivational interviewing/engagement officer.  Joint interview with police OM or other relevant agencies? To raise concerns Referral to substance misues worker for additional support. Warning letters to be employed Recall/Breach if risk not manageable.",
        "victimSafetyPlanning": "[RM33] Undertake sentence planning with OS within 8 or 16 weeks of sentence carats - continue to work with Mr Smith and refer for relevant programmes during any prison sentence imposed. DIP supervise DRR is imposed or provide support post release if conditions/requirements to manage the specific risks.",
        "interventionsAndTreatment": "[RM32] Requires referral to community drug DIP upon  release. To link in with employment/training resources such as College and ETEO. Completion of victim empathy module via 1-1 supervision to build upon awareness of impact of offending.   Level setting to be undertaken by Senior Probation Officer and OMU. Multi Agency Public Protection Panel to be convened if level 2 either at start of supervision or 6 months prior to release",
        "monitoringAndControl": "[RM31] State they will have secure accommodation for Mr Smith  and partner on release, although she too is subject to a DRR at present. Supportive wider family.  Has completed previously Short Duration programme and attended one of the support sessions .  Engaged with CARATS in custody.  Complied with voluntary drug tests in custody. Some motivation to desist from alcohol/drug use in the future, this needs to be encouraged with use of community resources. Completed drug and heroin awareness programmes in custody.",
        "supervision": "[RM30] Probation Officer, Education training and employment Officer, Prison Offender Supervisor",
        "keyInformationAboutCurrentSituation": "[RM28.1] Currently on remand at HMP Wandsworth - Management of case under MAPPA - level not yet set."
      }
    }
  }
}
